# Create Pandas and Use How Many Features In Pandas

## Import The Required Packages

In [1]:
import numpy as np
import pandas as pd

## Creation of Pandas Series

In [253]:
pds = pd.Series(list("ABCDEF"),range(0,6,1))

In [255]:
pds

0    A
1    B
2    C
3    D
4    E
5    F
dtype: object

## Accessing Elements of Series

In [170]:
pds[13]

'N'

In [178]:
pds1=pd.Series(list("NTIGE"),range(0,5,1))
pds2=pd.Series(list("IHNNO"),range(0,5,1))
pds3=pd.Series(["apple","orange","banana","grapes","melon","pineapple"],range(0,6,1))
pds4=pd.Series(["blue","red","green","violet","white","black"],range(0,6,1))

## + Operation On Series

In [222]:
print(pds1,pds2)
pds1+pds2

0    N
1    T
2    I
3    G
4    E
dtype: object 0    I
1    H
2    N
3    N
4    O
dtype: object

0    NI
1    TH
2    IN
3    GN
4    EO
dtype: object

In [277]:
X = list("aeiouAEIOU")
df = pd.DataFrame([X], index=[0], columns=list(range(len(X))))

In [279]:
df

   0  1  2  3  4  5  6  7  8  9
0  a  e  i  o  u  A  E  I  O  U

In [231]:
import pandas as pd

pds1 = pd.Series(list("NTIGE"), range(0, 5, 1))
pds2 = pd.Series(list("IHNNO"), range(0, 5, 1))

# Combine the two Series row-wise
row_wise_output = ["{}{}".format(x, y) for x, y in zip(pds1, pds2)]

# Concatenate all rows into a single string
final_output = "".join(row_wise_output)

# Create a DataFrame
data = {
    i: [char] for i, char in enumerate(final_output)
}
df = pd.DataFrame.from_dict(data) 
print(df)

   0  1  2  3  4  5  6  7  8  9
0  N  I  T  H  I  N  G  N  E  O

## Creation of DataFrame from Python Dictionary whihch Includes Pandas Series

In [257]:
df1 = {"One":pds,"Two":pds1,"Three":pds3,"Four":pds4}
pd_df1 = pd.DataFrame(df1)

In [259]:
pd_df1

  One  Two      Three    Four
0   A    N      apple    blue
1   B    T     orange     red
2   C    I     banana   green
3   D    G     grapes  violet
4   E    E      melon   white
5   F  NaN  pineapple   black

In [261]:
pds5=pd.Series(list("1906"),range(4,8))

In [263]:
df2={"NithiN":pds4,"Neo":pds5}
pd_df2=pd.DataFrame(df2)

In [265]:
pd_df2

   NithiN  Neo
0    blue  NaN
1     red  NaN
2   green  NaN
3  violet  NaN
4   white    1
5   black    9
6     NaN    0
7     NaN    6

## Accessing a Particular Column

In [269]:
pd_df2["NithiN"]

0      blue
1       red
2     green
3    violet
4     white
5     black
6       NaN
7       NaN
Name: NithiN, dtype: object

## Accessing a Group of Particular Columns

In [13]:
pd_df1[["one","three"]]

  one      three
0   a      apple
1   b     orange
2   c     banana
3   d     grapes
4   e      melon
5   f  pineapple

## Accessing a Particlar Cell Using Index and Column Names

In [42]:
pd_df1.loc[0,"one"]

'a'

## Accessing a Particlar Cell Using Index and Column ID(Numbers)

In [45]:
pd_df1.iloc[5,2]

'pineapple'

## Adding a New Column to a Dataframe

In [48]:
pd_df1["ten"]=pd.Series(range(10,70,10),range(0,6))

In [50]:
pd_df1

  one two      three    four  ten
0   a   l      apple    blue   10
1   b   m     orange     red   20
2   c   n     banana   green   30
3   d   o     grapes  violet   40
4   e   p      melon   white   50
5   f   q  pineapple   black   60

In [52]:
pd_df1_1 = pd_df1

## Removing a Particular Column

In [55]:
pd_df1_1.drop("four",axis=1)

  one two      three  ten
0   a   l      apple   10
1   b   m     orange   20
2   c   n     banana   30
3   d   o     grapes   40
4   e   p      melon   50
5   f   q  pineapple   60

## Removing a Particlaur Row

In [58]:
pd_df1_1.drop(3,axis=0)

  one two      three   four  ten
0   a   l      apple   blue   10
1   b   m     orange    red   20
2   c   n     banana  green   30
4   e   p      melon  white   50
5   f   q  pineapple  black   60

## Making Changes of Column or Row of DataFrame Using Inplace

In [65]:
pd_df1_1.drop(2,axis=0,inplace=True)

In [67]:
pd_df1_1

  one two      three   four  ten
0   a   l      apple   blue   10
1   b   m     orange    red   20
4   e   p      melon  white   50
5   f   q  pineapple  black   60

## Getting The Dimension of a DataFrame

In [70]:
pd_df1_1.shape

(4, 5)

## Slicing of a DataFrame With Columns Name

In [73]:
pd_df1.loc[:,"one":"three"]

  one two      three
0   a   l      apple
1   b   m     orange
4   e   p      melon
5   f   q  pineapple

## Slicing of a Dataframe With Rows & Columns Names

In [76]:
pd_df1.loc[2:5,"one":"three"]

  one two      three
4   e   p      melon
5   f   q  pineapple

## Accessing a DataFrame Based on Condition of Column or Row Values

In [79]:
pd_df1[pd_df1["ten"]>30]

  one two      three   four  ten
4   e   p      melon  white   50
5   f   q  pineapple  black   60

## Accessing a DataFrame Columns Based on Condition of Column or Row Values

In [82]:
pd_df1[pd_df1["ten"]>30][["four","two"]]

    four two
4  white   p
5  black   q

In [84]:
pd_df2_1 = pd_df2_2 = pd_df2

In [86]:
pd_df2_1

     alfa beta
0    blue  NaN
1     red  NaN
2   green  NaN
3  violet  NaN
4   white    7
5   black    8
6     NaN    9
7     NaN    6

## Dropping Rows Which are Having Nulls

In [89]:
pd_df2_1.dropna()

    alfa beta
4  white    7
5  black    8

## Filling With Specified Values to a Nulls

In [92]:
pd_df2_2.fillna(100)

     alfa beta
0    blue  100
1     red  100
2   green  100
3  violet  100
4   white    7
5   black    8
6     100    9
7     100    6

In [94]:
pds6=pd.Series(["apple","orange","banana","apple","orange","pineapple"],range(0,6,1))
pds7=pd.Series(range(100,700,100),range(0,6,1))
df4={"qwerty":pds6,"asdf":pds7}
pd_df4=pd.DataFrame(df4)

In [96]:
pd_df4

      qwerty  asdf
0      apple   100
1     orange   200
2     banana   300
3      apple   400
4     orange   500
5  pineapple   600

## Grouping Based on Column Values and Applying a Relationship on Other Columns

In [99]:
pd_df4.groupby("qwerty").mean()

            asdf
qwerty
apple      250.0
banana     300.0
orange     350.0
pineapple  600.0

## Describing Characterstics of Column With Numirical Data

In [102]:
pd_df4["asdf"].describe()

count      6.000000
mean     350.000000
std      187.082869
min      100.000000
25%      225.000000
50%      350.000000
75%      475.000000
max      600.000000
Name: asdf, dtype: float64

## Desribing Charaterstics of Column With Categorical Data

In [105]:
pd_df4["qwerty"].describe()

count         6
unique        4
top       apple
freq          2
Name: qwerty, dtype: object

## DataFrame Concatenation

In [108]:
pds1=pd.Series(['a0','a1','a2'],range(3))
pds2=pd.Series(['b0','b1','b2'],range(2,5))
pds3=pd.Series(['a3','a4','a5'],range(3))
pds4=pd.Series(['b3','b4','b5'],range(2,5))

In [110]:
pda1=pd.DataFrame({'A1':pds1,'A2':pds3})

In [112]:
pdb1=pd.DataFrame({'B1':pds2,'B2':pds4})

In [114]:
pda1

   A1  A2
0  a0  a3
1  a1  a4
2  a2  a5

In [116]:
pdb1

   B1  B2
2  b0  b3
3  b1  b4
4  b2  b5

In [118]:
pd.concat([pda1,pdb1],axis=1)

    A1   A2   B1   B2
0   a0   a3  NaN  NaN
1   a1   a4  NaN  NaN
2   a2   a5   b0   b3
3  NaN  NaN   b1   b4
4  NaN  NaN   b2   b5

In [120]:
pd.concat([pda1,pdb1],axis=0)

    A1   A2   B1   B2
0   a0   a3  NaN  NaN
1   a1   a4  NaN  NaN
2   a2   a5  NaN  NaN
2  NaN  NaN   b0   b3
3  NaN  NaN   b1   b4
4  NaN  NaN   b2   b5

## DataFrame Join(it is Basically on Rows/Indexes)

In [123]:
pda1.join(pdb1,how='inner')

   A1  A2  B1  B2
2  a2  a5  b0  b3

In [125]:
pda1.join(pdb1,how='outer')

    A1   A2   B1   B2
0   a0   a3  NaN  NaN
1   a1   a4  NaN  NaN
2   a2   a5   b0   b3
3  NaN  NaN   b1   b4
4  NaN  NaN   b2   b5

In [127]:
pda1.join(pdb1,how='left')

   A1  A2   B1   B2
0  a0  a3  NaN  NaN
1  a1  a4  NaN  NaN
2  a2  a5   b0   b3

In [129]:
pda1.join(pdb1,how='right')

    A1   A2  B1  B2
2   a2   a5  b0  b3
3  NaN  NaN  b1  b4
4  NaN  NaN  b2  b5